notes/cv.tex
% Created 2025-09-28 dim. 20:04
% Intended LaTeX compiler: lualatex
\documentclass[a4paper,12pt]{article}
\usepackage{amsmath}
\usepackage{fontspec}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{luacode}
\usepackage[french]{babel}
\usepackage{microtype}
\usepackage[autolanguage]{numprint}
\npthousandsep{~}
\usepackage{fontspec}
\setmainfont{Source Serif 4}[Path=/home/anthea/org/fonts/Source_Serif_4/static/, UprightFont=SourceSerif4-Regular.ttf, ItalicFont=SourceSerif4-Italic.ttf, BoldFont=SourceSerif4-Bold.ttf, BoldItalicFont=SourceSerif4-BoldItalic.ttf]
\setsansfont{Source Sans 3}[Path=/home/anthea/org/fonts/Source_Sans_3/static/, UprightFont=SourceSans3-Regular.ttf, ItalicFont=SourceSans3-Italic.ttf, BoldFont=SourceSans3-Bold.ttf, BoldItalicFont=SourceSans3-BoldItalic.ttf]
\setmonofont{Source Code Pro}[Path=/home/anthea/org/fonts/Source_Code_Pro/static/, UprightFont=SourceCodePro-Regular.ttf, ItalicFont=SourceCodePro-Italic.ttf, BoldFont=SourceCodePro-Bold.ttf, BoldItalicFont=SourceCodePro-BoldItalic.ttf]
\renewcommand{\familydefault}{\sfdefault}
\usepackage[usenames,dvipsnames,svgnames,table]{xcolor}
\definecolor{customgray}{HTML}{505050}
\usepackage[top=3.2cm, bottom=3.2cm, left=2.4cm, right=2.4cm]{geometry}
\usepackage[cm]{fullpage}
\usepackage{setspace,fancyhdr,indentfirst,lastpage,datetime,authblk,ifthen,etoolbox,titling}
\singlespacing
\pagestyle{fancy}
\fancyhf{}
\fancyfoot[C]{\thepage\ / \pageref{LastPage}}
\renewcommand{\headrulewidth}{0pt}
\setlength{\parindent}{0pt}
\setcounter{secnumdepth}{3}
\setlength{\columnsep}{0.8cm}
\setlength{\marginparwidth}{1.6cm}
\setcounter{page}{1}
\usepackage{csquotes}
\usepackage{array,booktabs,multirow,tabularx,colortbl,diagbox,makecell,ltablex,adjustbox,multicol}
\usepackage{enumitem}\setlist{nosep}\setlist[itemize]{leftmargin=*}
\usepackage[toc,page]{appendix}
\usepackage[nottoc]{tocbibind}
\newenvironment{keyword}{\begin{trivlist}\item[]{\bfseries Mots-clés :}}{\end{trivlist}}
\usepackage{graphicx,caption,wrapfig}
\usepackage[most,breakable,xparse,listings,skins]{tcolorbox}
\usepackage[colorinlistoftodos]{todonotes}
\usepackage{newfloat}
\DeclareFloatingEnvironment[fileext=lol,listname={\vspace{-2em}},name=Listing]{listing}
\captionsetup{format=plain,font=small,labelfont=bf}
\captionsetup[listing]{labelfont=bf,textfont=it}
\usepackage{fvextra,amsfonts,amssymb,amsmath,mathrsfs,mathtools,stmaryrd}
\usepackage{algorithm2e}
\usepackage{pgf,tikz,pgfplots,pgfplotstable,arydshln,subcaption,forest}
\pgfplotsset{compat=1.18}
\usepackage[acronym]{glossaries}
\makenoidxglossaries
\usepackage{url,orcidlink,hyperref}
\hypersetup{colorlinks=true, linkcolor=customgray, citecolor=customgray, urlcolor=customgray, pdfborder={0 0 0}, unicode=true}
\author{Cyprien PIERRE}
\date{2025-09-28}
\title{DorctorPh.D. Student in constraint-based engineering\\\medskip
\large Specialised in electrotechnical and HVAC studies for industrial projects}
\hypersetup{
 pdfauthor={Cyprien PIERRE},
 pdftitle={DorctorPh.D. Student in constraint-based engineering},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={},
 pdflang={French}}
\usepackage[style=backend=biber,style=iso-numeric,citestyle=numeric-comp,doi=true,isbn=true,mincrossrefs=2,autocite=superscript]{biblatex}
\addbibresource{~/org/references.bib}
\begin{document}

\maketitle
\begin{ABSTRACT}
\begin{itemize}
\item Travaux
\item Valeurs
\end{itemize}
\end{ABSTRACT}


\textbf{Keywords: }\keywords{Human-Computer Interaction, Constraints, Collaboration, Engineering, Management}
\section{Publications}
\label{sec:org8725526}
\textbf{Thesis:}
\begin{itemize}
\item set title
\end{itemize}
\textbf{Articles:}
\begin{itemize}
\item eduBIM 2025
\end{itemize}
\textbf{Conferences:}
\begin{itemize}
\item eduBIM 2025
\end{itemize}
\textbf{Posters:}
\begin{itemize}
\item None
\end{itemize}
\textbf{Others:}
\begin{itemize}
\item SBA's second white book on BIS BOS
\end{itemize}
\section{Personal projects}
\label{sec:org0837de2}
\begin{itemize}
\item quickDoc:
\item quickMotion:
\item quickViz:
\item quickPublish:
\end{itemize}
\section{Education}
\label{sec:org464448e}
\begin{longtable}{|p{2cm}|p{3cm}|p{5cm}|p{7cm}|}
\caption{Degree}
\\
\textbf{Date} & \textbf{Degree} & \textbf{School} & \textbf{Field}\\
2028 & Ph.D. & ED PHF & Informatique and applications - Constraint based engineering\\
2024 & Master & INSA UPHF & Civil Engineering - Ingénierie Numérique Collaborative pour la Construction\\
2018 & Licence & IUT Toulouse & Professionnal degree in HVAC Engineering and construction\\
2017 & Technician & Licée G. Monge & Fluides Energie and Domotique - Génie Climatique et Fluidique\\
2016 & DUT & IUT Nantes & Thermal and energetic engineering\\
2015 & Bachelor & Licée Livet & Sciences et Technologies de l’Industrie et du Développement Durable - Energie et Environnement\\
\end{longtable}

\begin{longtable}{|p{2cm}|p{3cm}|p{5cm}|p{7cm}|}
\caption{Trainning course}
\\
\textbf{Date} & \textbf{Degree} & \textbf{School} & \textbf{Field}\\
 &  &  & \\
\end{longtable}
\section{Experiences}
\label{sec:org2405a38}
\begin{longtable}{|p{2cm}|p{3cm}|p{5cm}|p{7cm}|}
\caption{Professionnal experiences}
\\
\textbf{Date} & \textbf{Role} & \textbf{Company} & \textbf{type}\\
since 2025 & Researcher & LAMIH UMR CNRS 8201 \emph{(Valenciennes)} & CDD\\
since 2024 & Project Manager & EES FERROVIAIRE \emph{(Rennes)} & CDI\\
2022-2024 & Engineer & EES CLEMESSY ADS \emph{(Rennes)} & CDD\\
2020-2022 & Consulting & ADENTIS \emph{(Brest)} & CDI\\
2020-2020 & Designer & A.T.B.E. \emph{(Toulouse)} & CDI\\
2018-2020 & Designer & BETEM XD \emph{(Toulouse)} & CDI\\
2017-2018 & Designer & SNCF GARES \& CONNEXIONS \emph{(Toulouse)} & CDD\\
2017-2017 & Designer & LOMBARDI \emph{(Lyon)} & INTERNSHIP\\
\end{longtable}

\begin{longtable}{|p{2cm}|p{3cm}|p{5cm}|p{7cm}|}
\caption{Engineering experiences}
\\
\textbf{Date} & \textbf{Role} & \textbf{Company} & \textbf{Localization}\\
since 2024 & Project Manager & Villeneuve Demain & Villeneuve Saint Georges\\
2022-2023 & BIM Manager & Boat maintenance area & Toulon\\
2021-2022 & BIM Coordinator & Electricity supply plant & Finistere\\
2020 & BIM Modeler & Centre industriel de métallurgie extractive & Bessines-sur-Gartempe\\
2020 & BIM Modeler & Quai Deschamps & Bordeaux\\
2019 & BIM Modeler & Centre de détention & Koné\\
2020 & BIM Modeler & Hôtel de police & Cayenne\\
2018 & BIM Modeler & Ariane 6 Launch site & Kourou\\
2019 & BIM Modeler & Centre de valorisation énergétique du SYCTOM & Saint Ouens\\
2019 & BIM Modeler & Luggages sorting – Félix Eboué's Airport & Matoury\\
2019 & BIM Modeler & Siège social de Latécoère & Toulouse\\
2019 & BIM Modeler & AMP's Offices & Marseille\\
2019 & BIM Modeler & Ilot 6D Zac de Montaudran & Montaudran\\
2019 & BIM Modeler & Projet de conservatoire de La Rochelle & La Rochelle\\
2018 & BIM Modeler & Cinaspic Le MA.AT & Arcachon\\
2019 & BIM Modeler & Thermes de Bagnères-de-Luchon & Bagnères-de-Luchon\\
2019 & BIM Modeler & C.R.E.A.T.I.F. & Gradignan\\
2019 & BIM Modeler & Collège Achmat Kartadinama & Grand Santi\\
2016 & BIM Modeler & Fréjus tunnel's LT ST2-01-20 & Modane\\
\end{longtable}

\begin{longtable}{|p{2cm}|p{3cm}|p{5cm}|p{7cm}|}
\caption{Non-profit organization experiences}
\\
\textbf{Date} & \textbf{Role} & \textbf{Name} & \textbf{Type}\\
since 2015 & Founder, & FarfaDub & Music group\\
since 2015 & Founder & The Solar Voices System & Association de fait\\
2021–2022 & Trésorier & Collectif Insolite & Association loi 1901\\
2019–2020 & Membre & Contrasted Collective & Association de fait\\
2018–2020 & Project manager & Open My Mind Kindly & Association loi 1901\\
2018–2020 & Membre & Asso’Berhanena Selam & Association loi 1901\\
2018–2020 & Bénévole & Elevent & Association loi 1901\\
2018–2019 & Bénévole & Labophonix & Association loi 1901\\
2017–2018 & Bénévole & Planet AJAL & Association loi 1901\\
2017–2019 & Bénévole & Get Up & Association loi 1901\\
2016–2018 & Membre & 40 Hz & Association loi 1901\\
\end{longtable}

\begin{longtable}{|p{2cm}|p{3cm}|p{5cm}|p{7cm}|}
\caption{Cultural events experiences}
\\
\textbf{Date} & \textbf{Role} & \textbf{Name} & \textbf{Type}\\
 &  &  & \\
\end{longtable}
\end{document}
